leetcode/128/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>128. Longest Consecutive Sequence - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo liu" />
  <meta name="description" content="leetcode" />
  <meta name="keywords" content="leetcode, ruby" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                            <li class="active"><a href="/prod/">Prod</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>128. Longest Consecutive Sequence</h1>
            
<div id="outline-container-org7617bb8" class="outline-2">
<h2 id="org7617bb8">题目</h2>
<div class="outline-text-2" id="text-org7617bb8">
<p>
<a href="https://leetcode.com/problems/longest-consecutive-sequence/">链接</a>
</p>

<p class="verse">
Given an unsorted array of integers, find the length of the longest consecutive elements sequence.<br />
<br />
For example,<br />
Given [100, 4, 200, 1, 3, 2],<br />
The longest consecutive elements sequence is [1, 2, 3, 4]. Return its length: 4.<br />
<br />
Your algorithm should run in O(n) complexity.<br />
</p>
</div>
</div>

<div id="outline-container-org15cd243" class="outline-2">
<h2 id="org15cd243">思路</h2>
<div class="outline-text-2" id="text-org15cd243">
<p>
排序之后，数连续个数即可。由于不知道数的范围（太大）, 最优的效率也只是 \(O(n\log n)\)
</p>

<p>
如果能对每个数以及相邻数以 \(O(1)\) 进行快速查找, 就可以在 \(O(n)\) 知道每个连续分区的长度，从而知道最长的。
</p>

<p>
所以考虑用hash来存储做查找即可。
</p>
</div>
</div>


<div id="outline-container-orge59ab8a" class="outline-2">
<h2 id="orge59ab8a">代码</h2>
<div class="outline-text-2" id="text-orge59ab8a">
<div class="org-src-container">
<pre class="src src-ruby"># @param {Integer[]} nums
# @return {Integer}
def longest_consecutive(nums)
  set = Hash[*nums.map{ |p| [p, true]}.flatten]
  m = 0
  until set.empty?
    i, _ = set.shift
    size = 1 + findForward(set,i-1,0) + findBackward(set, i+1,0)
    m = size if m &lt; size
  end
  m
end

def findForward(set, c, num)
  set.delete(c) ? findForward(set,c-1,num+1) : num
end

def findBackward(set, c, num)
  set.delete(c) ? findBackward(set,c+1,num+1) : num
end
</pre>
</div>
</div>
</div>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2016-03-01</span>
        <span title="last modification date" class="post-info">2016-04-01</span>
        <span title="tags" class="post-info"><a href="/tags/leetcode/">leetcode</a>, <a href="/tags/ruby/">ruby</a></span>
        <span title="author" class="post-info">enzo liu</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo liu</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
